# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers" # For Mac Drivers s.a. Logitech Options
tap "homebrew/core"
tap "buo/cask-upgrade" # interactive Cask upgrading
tap "aws/tap"
tap "hashicorp/tap"

# Binaries
brew "apache-arrow"
brew "bash"
brew "readline"
brew "sqlite"
brew "xz"
brew "autojump"
brew "brew-cask-completion"
brew "python@3.9"
brew "doctl"
brew "dive"
brew "jq"
brew "gh" # Github CLI
brew "graphviz"
brew "helm"
brew "htop"
brew "kompose"
brew "kubernetes-cli"
brew "mas" # Mac Application Store interface
brew "minikube"
brew "netcat"
brew "node"
brew "openssl@3"
brew "pipx"
brew "poetry"
brew "psqlodbc"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rust"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "tldr"
brew "teleport"
brew "tree"
brew "virtualenv"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

## Geographical binaries
# brew "geos"
# brew "gdal"
# brew "proj"

# Azure
brew "azure-cli"
cask "microsoft-azure-storage-explorer"

# Amazon Web Services
brew "awscli"

# Google Cloud
cask "google-cloud-sdk"

# Drivers
cask "corsair-icue" # Corsair M55 RGB Pro Mouse
cask "logitech-options" # Logitech MX Keys Mini Keyboard


# Apps
cask "adobe-acrobat-reader"
cask "caffeine"
cask "discord"
cask "citrix-workspace"
cask "docker"
cask "filezilla"
cask "go2shell"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "lastpass"
cask "lens"
cask "lepton"
cask "microsoft-remote-desktop"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "monitorcontrol"
cask "multipass" # Ubuntu VM
cask "ngrok"
cask "notable"
cask "obsidian" # Markdown Editor
cask "postman"
cask "pycharm"
cask "rectangle"
cask "slack"
cask "spotify"
cask "mos" # Smooth Scrolling
cask "telegram"
cask "todoist"
cask "visual-studio-code"
cask "vpn-by-google-one"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zoom"


## Security
# cask "lulu"
# cask "blockblock"
# cask "knockknock"
# cask "taskexplorer"
# cask "ransomwhere"
# cask "oversight"
# cask "kextviewr"

## Leisure
cask "vcv-rack" # virtual modular synthesiser
cask "steam"
cask "parsec" # Remote Desktop

# Apps installed through Apple Store
mas "Be Focused", id: 973134470
