# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers" # For Mac Drivers s.a. Logitech Options
tap "homebrew/core"
tap "aws/tap"

# Binaries
brew "readline"
brew "sqlite"
brew "xz"
brew "autojump"
brew "brew-cask-completion"
brew "python@3.9"
brew "doctl"
brew "graphviz"
brew "helm"
brew "htop"
brew "kubernetes-cli"
brew "mas" # Mac Application Store interface
brew "minikube"
brew "netcat"
brew "node"
brew "openssl@3"
brew "poetry"
brew "psqlodbc"
brew "pyenv"
brew "pyenv-virtualenv"
brew "terraform"
brew "tldr"
brew "tree"
brew "virtualenv"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

## Geographical binaries
brew "geos"
brew "gdal"
brew "proj"

# Azure
brew "azure-cli"
cask "microsoft-azure-storage-explorer"

# Amazon Web Services
brew "awscli"
brew "aws-sam-cli"

# Google Cloud
cask "google-cloud-sdk"

# Drivers
cask "corsair-icue" # Corsair M55 RGB Pro Mouse
cask "logitech-options" # Logitech MX Keys Mini Keyboard


# Apps
cask "alfred"
cask "caffeine"
cask "dash"
# cask "discord"
cask "citrix-workspace"
cask "docker"
cask "go2shell"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "lastpass"
cask "lens"
cask "lepton"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "multipass" # Ubuntu VM
cask "notable"
cask "postman"
cask "pycharm"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stack"
cask "teamviewer"
cask "telegram"
cask "vanilla"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

## Leisure
cask "vcv-rack" # virtual modular synthesiser
cask "steam"

# Apps installed through Apple Store
mas "Be Focused", id: 973134470
