# Taps
tap "homebrew/bundle"
tap "buo/cask-upgrade" # interactive Cask upgrading
tap "azure/azd"
tap "aws/tap"
tap "hashicorp/tap"
tap "databricks/tap"

# Binaries
brew "bash" # updates bash to version 5.2, default on mac is 3.x 
brew "bat" # cat with syntax highlighting
brew "bat-extras"
brew "git-delta" # Color highlighting for git diffs 
brew "readline"
brew "databricks"
brew "xz"
brew "autojump"
brew "brew-cask-completion"
brew "doctl"
brew "jq" # Query json in terminal
brew "yq" # Query yaml in terminal
brew "graphviz"
brew "htop"
brew "mas" # Mac Application Store interface
brew "netcat"
brew "node"
brew "ncdu" # NCurses Disk Usage Explorer
brew "openssl@3"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "teleport" # Server access using proxy
brew "tree"
brew "yank" # Copy terminal output to clipboard
brew "zlib"

# Drivers
cask "corsair-icue" # Corsair M55 RGB Pro Mouse
cask "logitech-options" # Logitech MX Keys Mini Keyboard

## ZSH / terminal
brew "fzf" #fuzzy search
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

## python
brew "python@3.11"
brew "pyenv"
brew "pyenv-virtualenv"
brew "virtualenv"
brew "pipx"
brew "poetry"

# Docker / Kubernetes
brew "dive" # interactively inspect docker containers
brew "helm"
brew "kompose"
brew "kubernetes-cli"
brew "minikube"
cask "lens"

## databases
brew "sqlite"
brew "psqlodbc" # Postgres odbc driver

## Geographical binaries
# brew "geos"
# brew "gdal"
# brew "proj"

# Azure
brew "azure-cli"
brew "azd" # Azure Developer CLI
cask "microsoft-azure-storage-explorer"

# Amazon Web Services
# brew "awscli"

# Google Cloud
# cask "google-cloud-sdk"

# Apps
cask "adobe-acrobat-reader"
cask "caffeine"
cask "discord"
# cask "citrix-workspace"
# cask "podman-desktop" # Should install via *.dmg from website because on M1 the brew installation is non-functional.
cask "go2shell"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "lastpass"
# cask "microsoft-auto-update"
# cask "microsoft-office"
# cask "microsoft-teams"
cask "monitorcontrol" 
# cask "multipass" # Ubuntu VM
cask "ngrok"
cask "notion" # Notekeeping
cask "obsidian" # Markdown Editor
cask "postman"
cask "pycharm"
cask "rectangle"
cask "slack"
cask "spotify"
# cask "mos" # Smooth Scrolling
cask "telegram"
cask "todoist"
cask "visual-studio-code"
cask "vlc"
# cask "warp"
cask "whatsapp"
cask "zoom"

## Security
# cask "lulu"
# cask "blockblock"
# cask "knockknock"
# cask "taskexplorer"
# cask "ransomwhere"
# cask "oversight"
# cask "kextviewr"

## Leisure
# cask "vcv-rack" # virtual modular synthesiser
# cask "steam"

# Apps installed through Apple Store
mas "Be Focused", id: 973134470
